#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    "печенье": [
        {"shop": "пятерочка", "price": 9.99},
        {"shop": "ашан", "price": 10.99}
        # TODO тут с клавиатуры введите магазины и цены (можно копипастить ;)
    ],
    # TODO тут с клавиатуры введите другую сладость и далее словарь магазинов
    "конфеты": [
        {"shop": "магнит", "price": 30.99},
        {"shop": "пятерочка", "price": 32.99}
    ],
    "карамель": [
        {"shop": "магнит", "price": 41.99},
        {"shop": "ашан", "price": 45.99}
    ],
    "пирожное": [
        {"shop": "пятерочка", "price": 59.99},
        {"shop": "магнит", "price": 62.99}
    ]


}
# Указать надо только по 2 магазина с минимальными ценами

print("печенье\n", 
        sweets["печенье"][0]["shop"], sweets["печенье"][0]["price"],
        "\n",
        sweets["печенье"][1]["shop"], sweets["печенье"][1]["price"], 
    )
print("конфеты\n", 
        sweets["конфеты"][0]["shop"], sweets["конфеты"][0]["price"],
        "\n",
        sweets["конфеты"][1]["shop"], sweets["конфеты"][1]["price"], 
    )
print("карамель\n", 
        sweets["карамель"][0]["shop"], sweets["карамель"][0]["price"],
        "\n",
        sweets["карамель"][1]["shop"], sweets["карамель"][1]["price"], 
    )
print("пирожное\n", 
        sweets["пирожное"][0]["shop"], sweets["пирожное"][0]["price"],
        "\n",
        sweets["пирожное"][1]["shop"], sweets["пирожное"][1]["price"], 
    )

